# Домашняя работа по уроку "Атрибуты и методы объекта."
# ***************************************************************************************
#   Задача "Developer - не только разработчик":
# Реализуйте класс House, объекты которого будут создаваться следующим образом:
# House('ЖК Эльбрус', 30)
#
# Объект этого класса должен обладать следующими атрибутами:
# self.name - имя, self.number_of_floors - кол-во этажей
#   Также должен обладать методом go_to(new_floor), где new_floor - номер этажа(int),
# на который нужно приехать.
#   Метод go_to выводит на экран(в консоль) значения от 1 до new_floor(включительно).
#   Если же new_floor больше чем self.number_of_floors или меньше 1, то вывести строку
# "Такого этажа не существует".
#
# Пункты задачи:
#   - Создайте класс House.
#   - Вунтри класса House определите метод __init__, в который передадите название
#     и кол-во этажей.
#   - Внутри метода __init__ создайте атрибуты объекта self.name и self.number_of_floors,
#     присвойте им переданные значения.
#   - Создайте метод go_to с параметром new_floor и напишите логику внутри него на
#     основе описания задачи.
#   - Создайте объект класса House с произвольным названием и количеством этажей.
#   - Вызовите метод go_to у этого объекта с произвольным числом.
#****************************************************************************************

class House:
    def __init__(self, name, numb_floors):
        self.__name = name
        self.__number_of_floors = numb_floors

    def go_to(self, numb_floor):
        if numb_floor > 0 and numb_floor <= self.__number_of_floors:
            i = 1
            while i <= numb_floor:
                print("Тек. этаж:", i)
                i += 1
        else:
            print("Такого этажа не существует")
def start():
    h1 = House('ЖК Горский', 18)
    h2 = House('Домик в деревне', 2)
    h1.go_to(5)
    h2.go_to(10)

if __name__ == '__main__':
    start()